(function() {
    let chartDom = document.querySelector('.scatter-histogram');
    let myChart = echarts.init(chartDom);
    // prettier-ignore
    const femaleData = [
        [2016, 6],
        [2017, 5],
        [2018, 8],
        [2019, 5],
        [2019, 8],
        [2014, 6],
        [2017, 6],
        [2019, 5],
        [2012, 4],
        [2016, 12],
        [2016, 4],
        [2011, 5],
        [2020, 7],
        [2017, 10],
        [2018, 3],
        [2015, 4],
        [2016, 5],
        [2014, 4],
        [2012, 4],
        [2008, 2],
        [2012, 5],
        [2015, 5],
        [2014, 4],
        [2018, 6],
        [2009, 5],
        [2015, 7],
        [2012, 2],
        [2013, 3],
        [2016, 6],
        [2017, 6],
        [2011, 5],
        [1997, 5],
        [2010, 4],
        [2016, 4],
        [2018, 4],
        [2015, 6],
        [2007, 4],
        [2010, 7],
        [2017, 6],
        [2017, 4],
        [2016, 4],
        [2012, 6],
        [2017, 8],
        [2018, 3],
        [2012, 5],
        [2019, 7],
        [2019, 3],
        [2017, 5],
        [2012, 3],
        [2005, 3],
        [2015, 4],
        [2014, 4],
        [2011, 4],
        [2017, 7],
        [2014, 5],
        [2015, 2],
        [2016, 3],
        [2015, 3],
        [2017, 7],
        [2018, 6],
        [2012, 4],
        [2011, 4],
        [2018, 4],
        [2016, 8],
        [2012, 5],
        [2016, 5],
        [2017, 5],
        [2014, 4],
        [2012, 2],
        [2019, 5],
        [2010, 3],
        [2015, 9],
        [2007, 4],
        [2016, 5],
        [2016, 2],
        [2018, 7],
        [2018, 3],
        [2016, 3],
        [2012, 5],
        [2018, 5],
        [2017, 7],
        [2013, 7],
        [2019, 5],
        [2018, 6],
        [2017, 6],
        [2018, 2],
        [2015, 6],
        [2015, 7],
        [2011, 6],
        [2009, 4],
        [2019, 5],
        [2017, 4],
        [2016, 2],
        [2018, 8],
        [2006, 4],
        [2018, 9],
        [2011, 3],
        [2007, 4],
        [2017, 5],
        [2018, 5],
        [2014, 5],
        [2017, 7],
        [2018, 12],
        [2011, 5],
        [2011, 4],
        [2011, 6],
        [2009, 6],
        [2017, 10],
        [2013, 3],
        [2020, 5],
        [2014, 4],
        [2019, 4],
        [2019, 6],
        [2017, 5],
        [2019, 2],
        [2017, 5],
        [2018, 6],
        [2016, 2],
        [2013, 4],
        [2013, 3],
        [2009, 4],
        [2007, 5],
        [2014, 5],
        [1997, 3],
        [2005, 3],
        [2015, 6],
        [2017, 4],
        [2010, 4],
        [2001, 4],
        [2011, 5],
        [2012, 5],
        [2017, 5],
        [2011, 4],
        [2016, 13],
        [2018, 9],
        [2009, 3],
        [2014, 5],
        [2018, 8],
        [2018, 4],
        [2018, 4],
        [2017, 4],
        [2015, 7],
        [2014, 8],
        [2018, 4],
        [2012, 5],
        [2009, 4],
        [2016, 4],
        [2013, 4],
        [2019, 6],
        [2017, 7],
        [2014, 5],
        [2014, 5]
    ];
    // prettier-ignore
    const maleDeta = [
        [2017, 7],
        [2015, 7],
        [2018, 9],
        [2012, 5],
        [2009, 4],
        [2004, 3],
        [2017, 5],
        [2017, 14],
        [2007, 3],
        [2013, 7],
        [2010, 2],
        [2019, 5],
        [2017, 6],
        [2019, 5],
        [2017, 2],
        [2011, 3],
        [2012, 5],
        [2020, 9],
        [2017, 7],
        [2011, 6],
        [2019, 5],
        [2012, 8],
        [2019, 5],
        [2017, 3],
        [2014, 4],
        [2007, 5],
        [2010, 3],
        [2015, 5],
        [2017, 12],
        [2015, 7],
        [2012, 7],
        [2016, 9],
        [2017, 9],
        [2015, 5],
        [2015, 6],
        [2012, 5],
        [2005, 5],
        [1997, 5],
        [2014, 2],
        [2016, 4],
        [2016, 6],
        [2017, 6],
        [2019, 3],
        [2010, 4],
        [2007, 4],
        [2017, 4],
        [2015, 4],
        [2016, 9],
        [2014, 5],
        [2017, 12],
        [2014, 7],
        [2011, 5],
        [2013, 5],
        [2018, 6],
        [2014, 6],
        [2014, 5],
        [2018, 2],
        [2009, 3],
        [2014, 5],
        [2017, 7],
        [2019, 7],
        [2012, 6],
        [2019, 7],
        [2016, 4],
        [2017, 5],
        [2017, 7],
        [2019, 4],
        [2011, 4],
        [2014, 4],
        [2008, 6],
        [2015, 5],
        [2014, 7],
        [2018, 9],
        [2008, 4],
        [1999, 5],
        [2019, 7],
        [2018, 8],
        [2011, 7],
        [2013, 5],
        [2018, 9],
        [2019, 9],
        [2013, 7],
        [1995, 3],
        [2011, 5],
        [2016, 6],
        [2015, 5],
        [2017, 7],
        [2010, 7],
        [2017, 4],
        [2019, 7],
        [2016, 5],
        [2014, 4],
        [2008, 6],
        [2018, 7],
        [2019, 4],
        [2017, 7],
        [2016, 7],
        [2012, 5],
        [2015, 13],
        [2017, 4],
        [2017, 5],
        [2019, 6],
        [2016, 4],
        [2013, 5],
        [2012, 9],
        [1996, 5],
        [2016, 18],
        [2008, 4],
        [2005, 11],
        [2004, 2],
        [2003, 2],
        [1998, 6],
        [1999, 2],
        [2014, 5],
        [2014, 5],
        [2016, 5],
        [2010, 9],
        [2018, 10],
        [2013, 5],
        [2017, 5],
        [2011, 6],
        [2020, 9],
        [2014, 6],
        [2017, 6],
        [2018, 7],
        [2012, 4],
        [2010, 5],
        [2015, 10],
        [2012, 6],
        [2017, 10],
        [2018, 9],
        [2019, 4],
        [2015, 6],
        [2012, 4],
        [2012, 6],
        [2010, 5],
        [2017, 6],
        [2017, 10],
        [2010, 6],
        [2018, 6],
        [2012, 6],
        [2006, 4],
        [2015, 6],
        [2014, 4],
        [2017, 11],
        [2016, 5],
        [2014, 5]
    ];
    const scatterOption = (option = {
        xAxis: {
            scale: true,
            interval: 1,
            splitLine: {
                //网格线
                show: false
            },
            axisLabel: {
                interval: 0,
                rotate: 40,
                interval: 0,
                textStyle: {
                    fontSize: '8',
                    itemSize: ''
                }
            }
        },
        yAxis: {
            scale: true,
            interval: 1,
            splitLine: {
                //网格线
                show: false
            }
        },

        tooltip: {
            //提示框组件
            trigger: 'item' //触发类型,'item'数据项图形触发，主要在散点图，饼图等无类目轴的图表中使用。 'axis'坐标轴触发，主要在柱状图，折线图等会使用类目轴的图表中使用。
        },
        series: [{
                symbolSize: 10,
                type: 'scatter',
                id: 'female',
                dataGroupId: 'female',
                universalTransition: {
                    enabled: true,
                    delay: function(idx, count) {
                        return Math.random() * 400;
                    }
                },
                data: femaleData,
                itemStyle: {
                    normal: {
                        color: '#d87c7c', //改变折线点的颜色
                        lineStyle: {
                            color: '#d87c7c', //改变折线颜色
                            opacity: 0
                        }
                    }
                }
            },
            {
                symbolSize: 6,
                type: 'scatter',
                id: 'male',
                dataGroupId: 'male',
                universalTransition: {
                    enabled: true,
                    delay: function(idx, count) {
                        return Math.random() * 400;
                    }
                },
                data: maleDeta,
                itemStyle: {
                    normal: {
                        color: '#4b565b', //改变折线点的颜色
                        lineStyle: {
                            color: '#4b565b' //改变折线颜色
                        }
                    }
                }
            }
        ]
    });
    const barOption = {
        xAxis: {
            type: 'category',
            data: ['FemaleGroup', 'MaleGroup']
        },
        yAxis: {},
        tooltip: {
            //提示框组件
            trigger: 'item' //触发类型,'item'数据项图形触发，主要在散点图，饼图等无类目轴的图表中使用。 'axis'坐标轴触发，主要在柱状图，折线图等会使用类目轴的图表中使用。
        },
        series: [{
            type: 'bar',
            id: 'total',
            data: [{
                    // value: calculateAverage(maleDeta, 0),
                    value: maleDeta.length,
                    groupId: 'male',
                    itemStyle: {
                        normal: {
                            color: '#4b565b', //改变折线点的颜色
                            lineStyle: {
                                color: '#4b565b' //改变折线颜色
                            }
                        }
                    }
                },
                {
                    value: femaleData.length,
                    groupId: 'female',
                    itemStyle: {
                        normal: {
                            color: '#d87c7c', //改变折线点的颜色
                            lineStyle: {
                                color: '#d87c7c' //改变折线颜色
                            }
                        }
                    }
                }
            ],
            universalTransition: {
                enabled: true,
                seriesKey: ['female', 'male'],
                delay: function(idx, count) {
                    return Math.random() * 400;
                }
            }
        }]
    };
    let currentOption = scatterOption;
    let timer = setInterval(function() {
        currentOption = currentOption === scatterOption ? barOption : scatterOption;
        myChart.setOption(currentOption, true);
    }, 3000);
    myChart.setOption(currentOption);
    $(".scatter-histogram").hover(function() {
            clearInterval(timer);
        },
        function() {
            clearInterval(timer);
            timer = setInterval(function() {
                currentOption = currentOption === scatterOption ? barOption : scatterOption;
                myChart.setOption(currentOption, true);
            }, 3000);
        })
    window.addEventListener("resize", function() {
        // 让我们的图表调用 resize这个方法
        myChart.resize();
    })
})()